#ifndef AGENTS_H
#define AGENTS_H

#include <vector>

struct Bound {
    double low;
    double high;
};

// 2) П - параллелепипед (допустимая область для точек, границы для a_i)
// Границы согласно файлу Постановки: 
const std::vector<Bound> A_BOUNDS = {
    {0.0, 2.0},      // a0 ∈ [0,2]
    {4.0, 12.0},     // a1 ∈ [4,12]
    {-200.0, 1.74},  // a2 ∈ [-200, 1.74]
    {0.0, 176.54},   // a3 ∈ [0, 176.54]
    {8.0, 20.0},     // a4 ∈ [8,20]
    {0.0, 3.0},      // a5 ∈ [0,3]
    {0.0, 8.0}       // a6 ∈ [0,8]
};



#endif